/*
 * Copyright 2022 Huawei Technologies Co., Ltd
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *     http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 */

import * as hardUrl from 'sys/src-com/assets/hard-coding/url.json';
import { ItreeIcon } from '../domain';

export const TreeIcon: ItreeIcon = {
  root: {
    normal: `
      <?xml version="1.0" encoding="UTF-8"?>
      <svg width="52px" height="52px" viewBox="0 0 52 52" version="1.1" xmlns="${hardUrl.w3cUrl}"
      xmlns:xlink="${hardUrl.xlinkUrl}">
          <title>现象-Normal</title>
          <defs>
              <filter id="filter-1">
                  <feColorMatrix in="SourceGraphic" type="matrix"
                  values="0 0 0 0 0.380392 0 0 0 0 0.380392 0 0 0 0 0.380392 0 0 0 1.000000 0">
                  </feColorMatrix>
              </filter>
          </defs>
          <g id="系统性能" stroke="none" stroke-width="1" fill="none" fill-rule="evenodd">
              <g id="导图图标样式" transform="translate(-83.000000, -90.000000)">
                  <g id="现象未选中" transform="translate(85.000000, 92.000000)">
                      <circle id="椭圆形" stroke="#B8BECC" fill="#FFFFFF" cx="24" cy="24" r="23.5"></circle>
                      <g id="icon/24/现象" transform="translate(12.000000, 12.000000)" filter="url(#filter-1)">
                          <g>
                              <path d="M12,1 C12.2761424,1 12.5,1.22385763 12.5,1.5 L12.5003924,5.01760973 C15.968571,
                              5.26257058 18.7391074,8.03404199 18.9826027,11.502625 L19,11.5 L19,11.5 L23,
                              11.5 C23.2761424,11.5 23.5,11.7238576 23.5,12 C23.5,12.2761424 23.2761424,
                              12.5 23,12.5 L19,12.5 L18.9825321,12.4983808 C18.7385718,15.9664938 15.9682357,
                              18.7374531 12.5003924,18.9823903 L12.5,22.5 C12.5,22.7761424 12.2761424,23 12,
                              23 C11.7238576,23 11.5,22.7761424 11.5,22.5 L11.5006133,18.9824612 C8.03297047,
                              18.7380361 5.26252322,15.9679005 5.01760973,12.5003924 L1.5,12.5 C1.22385763,
                              12.5 1,12.2761424 1,12 C1,11.7238576 1.22385763,11.5 1.5,11.5 L5.01753877,
                              11.5006133 C5.26198751,8.0326352 8.0326352,5.26198751 11.5006133,5.01753877 L11.5,
                              1.5 C11.5,1.22385763 11.7238576,1 12,1 Z M12,6 C8.6862915,6 6,8.6862915 6,12 C6,
                              15.3137085 8.6862915,18 12,18 C15.3137085,18 18,15.3137085 18,12 C18,8.6862915 15.3137085,
                              6 12,6 Z M12,9 C13.6568542,9 15,10.3431458 15,12 C15,13.6568542 13.6568542,15 12,
                              15 C10.3431458,15 9,13.6568542 9,12 C9,10.3431458 10.3431458,9 12,9 Z M12,10 C10.8954305,
                              10 10,10.8954305 10,12 C10,13.1045695 10.8954305,14 12,14 C13.1045695,14 14,13.1045695 14,
                              12 C14,10.8954305 13.1045695,10 12,10 Z" id="形状结合备份-2" fill="#616161"></path>
                          </g>
                      </g>
                  </g>
              </g>
          </g>
      </svg>
    `,
    hover: `
    <?xml version="1.0" encoding="UTF-8"?>
      <svg width="52px" height="52px" viewBox="0 0 52 52" version="1.1" xmlns="${hardUrl.w3cUrl}"
      xmlns:xlink="${hardUrl.xlinkUrl}">
          <title>现象-Hover</title>
          <g id="系统性能" stroke="none" stroke-width="1" fill="none" fill-rule="evenodd">
              <g id="导图图标样式" transform="translate(-167.000000, -90.000000)">
                  <g id="现象Hover" transform="translate(169.000000, 92.000000)">
                      <circle id="椭圆形" stroke="#0067FF" fill="#FFFFFF" cx="24" cy="24" r="23.5"></circle>
                      <g id="形状结合备份-2" transform="translate(12.000000, 12.000000)" fill="#4C94FB">
                          <path d="M12,1 C12.2761424,1 12.5,1.22385763 12.5,1.5 L12.5003924,5.01760973 C15.968571,
                          5.26257058 18.7391074,8.03404199 18.9826027,11.502625 L19,11.5 L19,11.5 L23,
                          11.5 C23.2761424,11.5 23.5,11.7238576 23.5,12 C23.5,12.2761424 23.2761424,12.5 23,12.5 L19,
                          12.5 L18.9825321,12.4983808 C18.7385718,15.9664938 15.9682357,18.7374531 12.5003924,
                          18.9823903 L12.5,22.5 C12.5,22.7761424 12.2761424,23 12,23 C11.7238576,23 11.5,
                          22.7761424 11.5,22.5 L11.5006133,18.9824612 C8.03297047,18.7380361 5.26252322,
                          15.9679005 5.01760973,12.5003924 L1.5,12.5 C1.22385763,12.5 1,12.2761424 1,12 C1,
                          11.7238576 1.22385763,11.5 1.5,11.5 L5.01753877,11.5006133 C5.26198751,8.0326352 8.0326352,
                          5.26198751 11.5006133,5.01753877 L11.5,1.5 C11.5,1.22385763 11.7238576,1 12,1 Z M12,
                          6 C8.6862915,6 6,8.6862915 6,12 C6,15.3137085 8.6862915,18 12,18 C15.3137085,18 18,
                          15.3137085 18,12 C18,8.6862915 15.3137085,6 12,6 Z M12,9 C13.6568542,9 15,10.3431458 15,
                          12 C15,13.6568542 13.6568542,15 12,15 C10.3431458,15 9,13.6568542 9,12 C9,
                          10.3431458 10.3431458,9 12,9 Z M12,10 C10.8954305,10 10,10.8954305 10,12 C10,
                          13.1045695 10.8954305,14 12,14 C13.1045695,14 14,13.1045695 14,12 C14,
                          10.8954305 13.1045695,10 12,10 Z"></path>
                      </g>
                  </g>
              </g>
          </g>
      </svg>
    `,
    active: `
      <?xml version="1.0" encoding="UTF-8"?>
      <svg width="52px" height="52px" viewBox="0 0 52 52" version="1.1" xmlns="${hardUrl.w3cUrl}"
      xmlns:xlink="${hardUrl.xlinkUrl}">
          <title>现象-已选中</title>
          <g id="系统性能" stroke="none" stroke-width="1" fill="none" fill-rule="evenodd">
              <g id="导图图标样式" transform="translate(-347.000000, -90.000000)">
                  <g id="编组-33" transform="translate(349.000000, 92.000000)">
                      <circle id="椭圆形" stroke="#0067FF" stroke-width="2" fill="#FFFFFF" cx="24" cy="24" r="23"></circle>
                      <g id="编组" transform="translate(12.000000, 12.000000)" fill="#2072EA" fill-rule="nonzero">
                          <g id="形状结合">
                              <path d="M12,1 C12.2761424,1 12.5,1.22385763 12.5,1.5 L12.5003924,5.01760973 C15.968571,
                              5.26257058 18.7391074,8.03404199 18.9826027,11.502625 L19,11.5 L19,11.5 L23,
                              11.5 C23.2761424,11.5 23.5,11.7238576 23.5,12 C23.5,12.2761424 23.2761424,12.5 23,
                              12.5 L19,12.5 L18.9825321,12.4983808 C18.7385718,15.9664938 15.9682357,
                              18.7374531 12.5003924,18.9823903 L12.5,22.5 C12.5,22.7761424 12.2761424,23 12,
                              23 C11.7238576,23 11.5,22.7761424 11.5,22.5 L11.5006133,18.9824612 C8.03297047,
                              18.7380361 5.26252322,15.9679005 5.01760973,12.5003924 L1.5,12.5 C1.22385763,
                              12.5 1,12.2761424 1,12 C1,11.7238576 1.22385763,11.5 1.5,11.5 L5.01753877,
                              11.5006133 C5.26198751,8.0326352 8.0326352,5.26198751 11.5006133,5.01753877 L11.5,
                              1.5 C11.5,1.22385763 11.7238576,1 12,1 Z M12,6 C8.6862915,6 6,8.6862915 6,12 C6,
                              15.3137085 8.6862915,18 12,18 C15.3137085,18 18,15.3137085 18,12 C18,8.6862915 15.3137085,
                              6 12,6 Z M12,9 C13.6568542,9 15,10.3431458 15,12 C15,13.6568542 13.6568542,
                              15 12,15 C10.3431458,15 9,13.6568542 9,12 C9,10.3431458 10.3431458,9 12,9 Z"></path>
                          </g>
                      </g>
                  </g>
              </g>
          </g>
      </svg>
    `,
  },
  middle: {
    normal: `
      <?xml version="1.0" encoding="UTF-8"?>
      <svg width="52px" height="52px" viewBox="0 0 52 52" version="1.1" xmlns="${hardUrl.w3cUrl}"
      xmlns:xlink="${hardUrl.xlinkUrl}">
          <title>条件-Normal</title>
          <defs>
              <filter id="filter-1">
                  <feColorMatrix in="SourceGraphic" type="matrix"
                  values="0 0 0 0 0.380392 0 0 0 0 0.380392 0 0 0 0 0.380392 0 0 0 1.000000 0">
                  </feColorMatrix>
              </filter>
          </defs>
          <g id="系统性能" stroke="none" stroke-width="1" fill="none" fill-rule="evenodd">
              <g id="导图图标样式" transform="translate(-83.000000, -168.000000)">
                  <g id="条件未选中" transform="translate(85.000000, 170.000000)">
                      <circle id="椭圆形" stroke="#B8BECC" fill="#FFFFFF" cx="24" cy="24" r="23.5"></circle>
                      <g id="icon/24/现象" transform="translate(12.000000, 12.000000)" filter="url(#filter-1)">
                          <g id="编组-2" transform="translate(1.000000, 1.000000)">
                              <rect id="矩形" x="0" y="0" width="22" height="22"></rect>
                              <g id="编组" transform="translate(2.000000, 2.000000)" stroke="#616161"
                              stroke-linejoin="round">
                                  <polygon id="路径-5" points="6 0 0 8.5 6 17.5 12 8.5"></polygon>
                                  <polygon id="路径-5备份" points="12 0 6 8.5 12 17.5 18 8.5"></polygon>
                              </g>
                          </g>
                      </g>
                  </g>
              </g>
          </g>
      </svg>
    `,
    hover: `
      <?xml version="1.0" encoding="UTF-8"?>
      <svg width="52px" height="52px" viewBox="0 0 52 52" version="1.1" xmlns="${hardUrl.w3cUrl}"
      xmlns:xlink="${hardUrl.xlinkUrl}">
          <title>条件-Hover</title>
          <g id="系统性能" stroke="none" stroke-width="1" fill="none" fill-rule="evenodd">
              <g id="导图图标样式" transform="translate(-167.000000, -168.000000)">
                  <g id="条件Hover" transform="translate(169.000000, 170.000000)">
                      <circle id="椭圆形" stroke="#0067FF" fill="#FFFFFF" cx="24" cy="24" r="23.5"></circle>
                      <g id="编组" transform="translate(12.000000, 12.000000)">
                          <rect id="矩形" x="1" y="1" width="22" height="22"></rect>
                          <g transform="translate(2.000000, 2.000000)" fill="#4C94FB" id="形状结合">
                              <path d="M6.59151607,0.711658401 C6.79072398,0.4294472 7.20927602,0.4294472 7.40848393,
                              0.711658401 L7.40848393,0.711658401 L9.99999991,4.382 L12.5915161,0.711658401 C12.7726142,
                              0.455102763 13.1349884,0.431779524 13.3490458,0.641688682 L13.4084839,
                              0.711658401 L19.4084839,9.2116584 C19.5276907,9.38053468 19.5306878,9.60535612 19.4160251,
                              9.7773501 L19.4160251,9.7773501 L13.4160251,18.7773501 C13.2181141,19.0742166 12.7818859,
                              19.0742166 12.5839749,18.7773501 L12.5839749,18.7773501 L9.99899991,14.902 L7.41602515,
                              18.7773501 C7.23610603,19.0472288 6.85923054,19.0717632 6.64350118,18.8509534 L6.58397485,
                              18.7773501 L0.583974853,9.7773501 C0.4693122,9.60535612 0.472309287,
                              9.38053468 0.591516068,9.2116584 L0.591516068,9.2116584 Z M7,1.867 L1.606,9.507 L7,
                              17.597 L9.39799991,13.999 L6.58397485,9.7773501 C6.48569258,9.62992669 6.4738542,
                              9.44369126 6.54754655,9.28714204 L6.59151607,9.2116584 L9.38799991,
                              5.249 L7,1.867 Z M13,1.867 L10.6109999,5.249 L13.4084839,9.2116584 C13.5106612,
                              9.35640949 13.5274599,9.54226316 13.4579669,9.70072118 L13.4160251,9.7773501 L10.6009999,
                              13.999 L13,17.597 L18.393,9.507 L13,1.867 Z M9.99999991,6.116 L7.606,
                              9.507 L9.99999991,13.097 L12.393,9.507 L9.99999991,6.116 Z"></path>
                          </g>
                      </g>
                  </g>
              </g>
          </g>
      </svg>
    `,
    active: `
      <?xml version="1.0" encoding="UTF-8"?>
      <svg width="52px" height="52px" viewBox="0 0 52 52" version="1.1" xmlns="${hardUrl.w3cUrl}"
      xmlns:xlink="${hardUrl.xlinkUrl}">
          <title>条件-已选中</title>
          <g id="系统性能" stroke="none" stroke-width="1" fill="none" fill-rule="evenodd">
              <g id="导图图标样式" transform="translate(-347.000000, -168.000000)">
                  <g id="编组-33" transform="translate(349.000000, 170.000000)">
                      <circle id="椭圆形" stroke="#0067FF" stroke-width="2" fill="#FFFFFF" cx="24" cy="24" r="23"></circle>
                      <g id="编组" transform="translate(12.000000, 12.000000)">
                          <rect id="矩形" x="1" y="1" width="22" height="22"></rect>
                          <g transform="translate(2.000000, 2.000000)" fill="#2072EA" fill-rule="nonzero" id="形状结合">
                              <path d="M13.3490458,0.641688682 L13.4084839,0.711658401 L19.4084839,
                              9.2116584 C19.5106612,9.35640949 19.5274599,9.54226316 19.4579669,9.70072118 L19.4160251,
                              9.7773501 L13.4160251,18.7773501 C13.236106,19.0472288 12.8592305,
                              19.0717632 12.6435012,18.8509534 L12.5839749,18.7773501 L9.99899991,14.902 L7.41602515,
                              18.7773501 C7.23610603,19.0472288 6.85923054,19.0717632 6.64350118,18.8509534 L6.58397485,
                              18.7773501 L0.583974853,9.7773501 C0.485692579,9.62992669 0.473854195,
                              9.44369126 0.547546554,9.28714204 L0.591516068,9.2116584 L6.59151607,
                              0.711658401 C6.77261417,0.455102763 7.13498841,0.431779524 7.34904581,
                              0.641688682 L7.40848393,0.711658401 L9.99999991,4.382 L12.5915161,
                              0.711658401 C12.7726142,0.455102763 13.1349884,0.431779524 13.3490458,0.641688682 Z M7,
                              1.867 L1.606,9.507 L7,17.597 L9.39799991,13.999 L6.58397485,9.7773501 C6.48569258,
                              9.62992669 6.4738542,9.44369126 6.54754655,9.28714204 L6.59151607,9.2116584 L9.38799991,
                              5.249 L7,1.867 Z M13,1.867 L10.6109999,5.249 L13.4084839,9.2116584 C13.5106612,
                              9.35640949 13.5274599,9.54226316 13.4579669,9.70072118 L13.4160251,9.7773501 L10.6009999,
                              13.999 L13,17.597 L18.393,9.507 L13,1.867 Z"></path>
                          </g>
                      </g>
                  </g>
              </g>
          </g>
      </svg>
    `,
  },
  leaf: {
    noAdopted: {
      normal: `
        <?xml version="1.0" encoding="UTF-8"?>
        <svg width="52px" height="52px" viewBox="0 0 52 52" version="1.1" xmlns="${hardUrl.w3cUrl}"
        xmlns:xlink="${hardUrl.xlinkUrl}">
          <title>结果建议-未采纳-Normal</title>
          <g id="系统性能" stroke="none" stroke-width="1" fill="none" fill-rule="evenodd">
            <g id="导图图标样式" transform="translate(-83.000000, -337.000000)">
              <g id="调优助手/复用模块/图标树图/条件备份-6" transform="translate(85.000000, 337.000000)">
                <circle id="椭圆形备份-25" stroke="#B8BECC" fill="#FFFFFF" cx="24" cy="24" r="23.5"></circle>
                <circle id="椭圆形" stroke="#A1A1A1" fill="#C1C1C1" cx="24" cy="48" r="3.5"></circle>
                <g id="编组" transform="translate(12.000000, 12.000000)">
                  <rect id="矩形" opacity="0.251743862" x="1" y="1" width="22" height="22"></rect>
                  <rect id="矩形" fill="#616161" x="9" y="19" width="6" height="1" rx="0.5"></rect>
                  <rect id="矩形备份" fill="#616161" x="9" y="21" width="6" height="1" rx="0.5"></rect>
                  <path d="M12,1.5 C13.7949254,1.5 15.4199254,2.22753728 16.5961941,3.40380592 C17.7724627,
                  4.58007456 18.5,6.20507456 18.5,8 C18.5,9.44247639 18.0300242,10.7751494 17.2350738,
                  11.8534554 C16.4862639,12.8691745 15.4488068,13.6589226 14.2439154,14.1021336 L14.2439154,
                  14.1021336 L13.9776494,17.2877077 L10.253164,17.5289564 L9.7746602,14.1089342 C8.5618561,
                  13.6670278 7.51758144,12.8743905 6.76492617,11.8534554 C5.96997584,10.7751494 5.5,
                  9.44247639 5.5,8 C5.5,6.20507456 6.22753728,4.58007456 7.40380592,3.40380592 C8.58007456,
                  2.22753728 10.2050746,1.5 12,1.5 Z" id="形状结合" stroke="#616161"></path>
                </g>
              </g>
            </g>
          </g>
        </svg>
      `,
      hover: `
        <?xml version="1.0" encoding="UTF-8"?>
        <svg width="52px" height="52px" viewBox="0 0 52 52" version="1.1" xmlns="${hardUrl.w3cUrl}"
        xmlns:xlink="${hardUrl.xlinkUrl}">
          <title>结果建议-未采纳-Hover</title>
          <g id="系统性能" stroke="none" stroke-width="1" fill="none" fill-rule="evenodd">
            <g id="导图图标样式" transform="translate(-167.000000, -337.000000)">
              <g id="调优助手/复用模块/图标树图/条件备份-3" transform="translate(169.000000, 337.000000)">
                <circle id="椭圆形备份-25" stroke="#0067FF" fill="#FFFFFF" cx="24" cy="24" r="23.5"></circle>
                <circle id="椭圆形" stroke="#A1A1A1" fill="#C1C1C1" cx="24" cy="48" r="3.5"></circle>
                <g id="编组" transform="translate(12.000000, 12.000000)">
                  <rect id="矩形" opacity="0.251743862" x="1" y="1" width="22" height="22"></rect>
                  <path d="M14.5,21 C14.7761424,21 15,21.2238576 15,21.5 C15,21.7761424 14.7761424,22 14.5,
                  22 L9.5,22 C9.22385763,22 9,21.7761424 9,21.5 C9,21.2238576 9.22385763,21 9.5,21 L14.5,
                  21 Z M14.5,19 C14.7761424,19 15,19.2238576 15,19.5 C15,19.7761424 14.7761424,20 14.5,
                  20 L9.5,20 C9.22385763,20 9,19.7761424 9,19.5 C9,19.2238576 9.22385763,
                  19 9.5,19 L14.5,19 Z M12,1 C15.8659932,1 19,4.13400675 19,8 C19,10.8267918 17.3095459,
                  13.3249934 14.7959956,14.4193249 L14.7959956,14.4193249 L14.716,14.452 L14.5118283,
                  16.8996546 C14.4634544,17.4801418 14.007322,17.935576 13.4392977,17.9937206 L13.4392977,
                  17.9937206 L13.3159734,18 L10.6840266,18 C10.0599202,18 9.54000088,17.5216051 9.48819245,
                  16.8999036 L9.48819245,16.8999036 L9.283,14.452 L9.20400437,14.4193249 C6.76900257,
                  13.3591913 5.10645719,10.9815585 5.00492603,8.26401625 L5.00492603,8.26401625 L5,8 C5,
                  4.13400675 8.13400675,1 12,1 Z M12,2 C8.6862915,2 6,4.6862915 6,8 C6,10.6965211 7.77882073,
                  12.9775764 10.2270359,13.7337395 L10.2270359,13.7337395 L10.4847174,16.8166091 C10.4933556,
                  16.9202675 10.5800088,17 10.6840266,17 L10.6840266,17 L13.3159734,17 C13.4199912,
                  17 13.5066444,16.9202675 13.5152826,16.8166091 L13.5152826,16.8166091 L13.7729641,
                  13.7337395 C16.2211793,12.9775764 18,10.6965211 18,8 C18,4.6862915 15.3137085,2 12,2 Z"
                  id="形状结合" fill="#4C94FB"></path>
                </g>
              </g>
            </g>
          </g>
        </svg>
      `,
      active: `
        <?xml version="1.0" encoding="UTF-8"?>
        <svg width="52px" height="52px" viewBox="0 0 52 52" version="1.1" xmlns="${hardUrl.w3cUrl}"
        xmlns:xlink="${hardUrl.xlinkUrl}">
          <title>结果建议-未采纳-已选中</title>
          <g id="系统性能" stroke="none" stroke-width="1" fill="none" fill-rule="evenodd">
            <g id="导图图标样式" transform="translate(-347.000000, -337.000000)">
              <g id="调优助手/复用模块/图标树图/条件备份-2" transform="translate(349.000000, 337.000000)">
                <circle id="椭圆形备份-25" stroke="#0067FF" stroke-width="2" fill="#FFFFFF" cx="24" cy="24" r="23"></circle>
                <circle id="椭圆形" stroke="#A1A1A1" fill="#C1C1C1" cx="24" cy="48" r="3.5"></circle>
                <g id="编组" transform="translate(12.000000, 12.000000)">
                  <rect id="矩形" opacity="0.251743862" x="1" y="1" width="22" height="22"></rect>
                  <rect id="矩形" fill="#2072EA" x="9" y="19" width="6" height="1" rx="0.5"></rect>
                  <rect id="矩形备份" fill="#2072EA" x="9" y="21" width="6" height="1" rx="0.5"></rect>
                  <path d="M12,1.5 C13.7949254,1.5 15.4199254,2.22753728 16.5961941,3.40380592 C17.7724627,
                  4.58007456 18.5,6.20507456 18.5,8 C18.5,9.44247639 18.0300242,10.7751494 17.2350738,
                  11.8534554 C16.4862639,12.8691745 15.4488068,13.6589226 14.2439154,14.1021336 L14.2439154,
                  14.1021336 L13.9776494,17.2877077 L10.253164,17.5289564 L9.7746602,14.1089342 C8.5618561,
                  13.6670278 7.51758144,12.8743905 6.76492617,11.8534554 C5.96997584,10.7751494 5.5,9.44247639 5.5,
                  8 C5.5,6.20507456 6.22753728,4.58007456 7.40380592,3.40380592 C8.58007456,2.22753728 10.2050746,
                  1.5 12,1.5 Z" id="形状结合" stroke="#2072EA" fill="#2072EA"></path>
                </g>
              </g>
            </g>
          </g>
        </svg>
      `
    },
    adopted: {
      normal: `
        <?xml version="1.0" encoding="UTF-8"?>
        <svg width="52px" height="52px" viewBox="0 0 52 52" version="1.1" xmlns="${hardUrl.w3cUrl}"
        xmlns:xlink="${hardUrl.xlinkUrl}">
          <title>结果建议-已采纳-Normal</title>
          <g id="系统性能" stroke="none" stroke-width="1" fill="none" fill-rule="evenodd">
            <g id="导图图标样式" transform="translate(-83.000000, -262.000000)">
              <g id="编组" transform="translate(85.000000, 262.000000)">
                <circle id="椭圆形备份-25" stroke="#B8BECC" fill="#FFFFFF" cx="24" cy="24" r="23.5"></circle>
                <circle id="椭圆形" stroke="#91C94F" fill="#ABE666" cx="24" cy="48" r="3.5"></circle>
                <g transform="translate(12.000000, 12.000000)">
                  <rect id="矩形" opacity="0.251743862" x="1" y="1" width="22" height="22"></rect>
                  <rect id="矩形" fill="#616161" x="9" y="19" width="6" height="1" rx="0.5"></rect>
                  <rect id="矩形备份" fill="#616161" x="9" y="21" width="6" height="1" rx="0.5"></rect>
                  <path d="M12,1.5 C13.7949254,1.5 15.4199254,2.22753728 16.5961941,3.40380592 C17.7724627,
                  4.58007456 18.5,6.20507456 18.5,8 C18.5,9.44247639 18.0300242,10.7751494 17.2350738,
                  11.8534554 C16.4862639,12.8691745 15.4488068,13.6589226 14.2439154,14.1021336 L14.2439154,
                  14.1021336 L13.9776494,17.2877077 L10.253164,17.5289564 L9.7746602,14.1089342 C8.5618561,
                  13.6670278 7.51758144,12.8743905 6.76492617,11.8534554 C5.96997584,10.7751494 5.5,9.44247639 5.5,
                  8 C5.5,6.20507456 6.22753728,4.58007456 7.40380592,3.40380592 C8.58007456,2.22753728 10.2050746,
                  1.5 12,1.5 Z" id="形状结合" stroke="#616161"></path>
                </g>
              </g>
            </g>
          </g>
        </svg>
      `,
      hover: `
        <?xml version="1.0" encoding="UTF-8"?>
        <svg width="52px" height="52px" viewBox="0 0 52 52" version="1.1" xmlns="${hardUrl.w3cUrl}"
        xmlns:xlink="${hardUrl.xlinkUrl}">
          <title>结果建议-已采纳-Hover</title>
          <g id="系统性能" stroke="none" stroke-width="1" fill="none" fill-rule="evenodd">
            <g id="导图图标样式" transform="translate(-167.000000, -262.000000)">
              <g id="调优助手/复用模块/图标树图/条件备份" transform="translate(169.000000, 262.000000)">
                <circle id="椭圆形备份-25" stroke="#0067FF" fill="#FFFFFF" cx="24" cy="24" r="23.5"></circle>
                <circle id="椭圆形" stroke="#91C94F" fill="#ABE666" cx="24" cy="48" r="3.5"></circle>
                <g id="编组" transform="translate(12.000000, 12.000000)">
                  <rect id="矩形" opacity="0.251743862" x="1" y="1" width="22" height="22"></rect>
                  <path d="M14.5,21 C14.7761424,21 15,21.2238576 15,21.5 C15,21.7761424 14.7761424,22 14.5,22 L9.5,
                  22 C9.22385763,22 9,21.7761424 9,21.5 C9,21.2238576 9.22385763,21 9.5,21 L14.5,21 Z M14.5,
                  19 C14.7761424,19 15,19.2238576 15,19.5 C15,19.7761424 14.7761424,20 14.5,20 L9.5,20 C9.22385763,
                  20 9,19.7761424 9,19.5 C9,19.2238576 9.22385763,19 9.5,19 L14.5,19 Z M12,1 C15.8659932,1 19,
                  4.13400675 19,8 C19,10.8267918 17.3095459,13.3249934 14.7959956,14.4193249 L14.7959956,
                  14.4193249 L14.716,14.452 L14.5118283,16.8996546 C14.4634544,17.4801418 14.007322,
                  17.935576 13.4392977,17.9937206 L13.4392977,17.9937206 L13.3159734,18 L10.6840266,18 C10.0599202,
                  18 9.54000088,17.5216051 9.48819245,16.8999036 L9.48819245,16.8999036 L9.283,14.452 L9.20400437,
                  14.4193249 C6.76900257,13.3591913 5.10645719,10.9815585 5.00492603,8.26401625 L5.00492603,
                  8.26401625 L5,8 C5,4.13400675 8.13400675,1 12,1 Z M12,2 C8.6862915,2 6,4.6862915 6,8 C6,
                  10.6965211 7.77882073,12.9775764 10.2270359,13.7337395 L10.2270359,13.7337395 L10.4847174,
                  16.8166091 C10.4933556,16.9202675 10.5800088,17 10.6840266,17 L10.6840266,17 L13.3159734,
                  17 C13.4199912,17 13.5066444,16.9202675 13.5152826,16.8166091 L13.5152826,16.8166091 L13.7729641,
                  13.7337395 C16.2211793,12.9775764 18,10.6965211 18,8 C18,4.6862915 15.3137085,2 12,2 Z"
                  id="形状结合" fill="#4C94FB"></path>
                </g>
              </g>
            </g>
          </g>
        </svg>
      `,
      active: `
        <?xml version="1.0" encoding="UTF-8"?>
        <svg width="52px" height="52px" viewBox="0 0 52 52" version="1.1" xmlns="${hardUrl.w3cUrl}"
        xmlns:xlink="${hardUrl.xlinkUrl}">
          <title>结果建议-已采纳-已选中</title>
          <g id="系统性能" stroke="none" stroke-width="1" fill="none" fill-rule="evenodd">
            <g id="导图图标样式" transform="translate(-347.000000, -262.000000)">
              <g id="调优助手/复用模块/图标树图/条件备份-2" transform="translate(349.000000, 262.000000)">
                <circle id="椭圆形备份-25" stroke="#0067FF" stroke-width="2" fill="#FFFFFF" cx="24" cy="24" r="23"></circle>
                <circle id="椭圆形" stroke="#91C94F" fill="#ABE666" cx="24" cy="48" r="3.5"></circle>
                <g id="编组" transform="translate(12.000000, 12.000000)">
                  <rect id="矩形" opacity="0.251743862" x="1" y="1" width="22" height="22"></rect>
                  <rect id="矩形" fill="#2072EA" x="9" y="19" width="6" height="1" rx="0.5"></rect>
                  <rect id="矩形备份" fill="#2072EA" x="9" y="21" width="6" height="1" rx="0.5"></rect>
                  <path d="M12,1.5 C13.7949254,1.5 15.4199254,2.22753728 16.5961941,3.40380592 C17.7724627,
                  4.58007456 18.5,6.20507456 18.5,8 C18.5,9.44247639 18.0300242,10.7751494 17.2350738,
                  11.8534554 C16.4862639,12.8691745 15.4488068,13.6589226 14.2439154,14.1021336 L14.2439154,
                  14.1021336 L13.9776494,17.2877077 L10.253164,17.5289564 L9.7746602,14.1089342 C8.5618561,
                  13.6670278 7.51758144,12.8743905 6.76492617,11.8534554 C5.96997584,10.7751494 5.5,
                  9.44247639 5.5,8 C5.5,6.20507456 6.22753728,4.58007456 7.40380592,3.40380592 C8.58007456,
                  2.22753728 10.2050746,1.5 12,1.5 Z" id="形状结合" stroke="#2072EA" fill="#2072EA"></path>
                </g>
              </g>
            </g>
          </g>
        </svg>
      `
    }
  }
};
