import { IStaticIcon } from '../../domain';
import * as hardUrl from 'sys/src-com/assets/hard-coding/url.json';

/** 工程管理-启动任务 */
export const startTaskClick: IStaticIcon = {
  name: 'startTaskClick',
  data: `
    <?xml version="1.0" encoding="UTF-8"?>
    <svg viewBox="0 0 16 16" version="1.1" xmlns="${hardUrl.w3cUrl}" xmlns:xlink="${hardUrl.xlinkUrl}">
        <defs>
            <path d="M8,0 C12.418278,0 16,3.581722 16,8 C16,12.418278 12.418278,16 8,16 C3.581722,16 0,12.418278 0,
            8 C0,3.581722 3.581722,0 8,0 Z M8,1 C4.13400675,1 1,4.13400675 1,8 C1,11.8659932 4.13400675,15 8,
            15 C11.8659932,15 15,11.8659932 15,8 C15,4.13400675 11.8659932,1 8,1 Z M6.83357948,
            5.04464795 C7.02209891,4.9649556 7.24013422,4.99334733 7.40074496,5.11860246 L7.40074496,
            5.11860246 L10.2919771,7.3817803 C10.4234628,7.48506159 10.5,7.64110985 10.5,7.8061474 C10.5,
            7.97118495 10.4234628,8.1272332 10.2919771,8.23051449 L10.2919771,8.23051449 L7.40074496,
            10.4828117 C7.23385748,10.6118283 7.00639619,10.6363948 6.81483613,10.5461618 C6.62318919,
            10.4558438 6.50102078,10.2665585 6.5,10.0584446 L6.5,10.0584446 L6.5,5.49946815 C6.51687553,
            5.29915345 6.64508177,5.12434031 6.83357948,5.04464795 Z" id="path-1"></path>
        </defs>
        <g id="控件" stroke="none" stroke-width="1" fill="none" fill-rule="evenodd">
            <g id="画板" transform="translate(-189.000000, -64.000000)">
                <g id="启动任务Click" transform="translate(189.000000, 64.000000)">
                    <mask id="mask-2" fill="white">
                        <use xlink:href="#path-1"></use>
                    </mask>
                    <use id="蒙版" fill="#979797" fill-rule="nonzero" xlink:href="#path-1"></use>
                    <g id="编组" mask="url(#mask-2)" fill="#0057D9">
                        <g id="3.颜色/9.辅助文字">
                            <rect id="矩形" x="0" y="0" width="16" height="16"></rect>
                        </g>
                    </g>
                </g>
            </g>
        </g>
    </svg>
  `
};

export const startTaskHover: IStaticIcon = {
  name: 'startTaskHover',
  data: `
    <?xml version="1.0" encoding="UTF-8"?>
    <svg viewBox="0 0 16 16" version="1.1" xmlns="${hardUrl.w3cUrl}" xmlns:xlink="${hardUrl.xlinkUrl}">
        <defs>
            <path d="M8,0 C12.418278,0 16,3.581722 16,8 C16,12.418278 12.418278,
            16 8,16 C3.581722,16 0,12.418278 0,8 C0,3.581722 3.581722,
            0 8,0 Z M8,1 C4.13400675,1 1,4.13400675 1,8 C1,11.8659932 4.13400675,
            15 8,15 C11.8659932,15 15,11.8659932 15,8 C15,
            4.13400675 11.8659932,1 8,1 Z M6.83357948,5.04464795 C7.02209891,
            4.9649556 7.24013422,4.99334733 7.40074496,
            5.11860246 L7.40074496,5.11860246 L10.2919771,7.3817803 C10.4234628,
            7.48506159 10.5,7.64110985 10.5,7.8061474 C10.5,
            7.97118495 10.4234628,8.1272332 10.2919771,8.23051449 L10.2919771,
            8.23051449 L7.40074496,10.4828117 C7.23385748,
            10.6118283 7.00639619,10.6363948 6.81483613,10.5461618 C6.62318919,
            10.4558438 6.50102078,10.2665585 6.5,10.0584446 L6.5,
            10.0584446 L6.5,5.49946815 C6.51687553,5.29915345 6.64508177,
            5.12434031 6.83357948,5.04464795 Z" id="path-1"></path>
        </defs>
        <g id="控件" stroke="none" stroke-width="1" fill="none" fill-rule="evenodd">
            <g id="画板" transform="translate(-189.000000, -43.000000)">
                <g id="启动任务Hover" transform="translate(189.000000, 43.000000)">
                    <mask id="mask-2" fill="white">
                        <use xlink:href="#path-1"></use>
                    </mask>
                    <use id="蒙版" fill="#979797" fill-rule="nonzero" xlink:href="#path-1"></use>
                    <g id="编组" mask="url(#mask-2)" fill="#267DFF">
                        <g id="3.颜色/9.辅助文字">
                            <rect id="矩形" x="0" y="0" width="16" height="16"></rect>
                        </g>
                    </g>
                </g>
            </g>
        </g>
    </svg>
  `
};

export const startTaskNormal: IStaticIcon = {
  name: 'startTaskNormal',
  data: `
    <?xml version="1.0" encoding="UTF-8"?>
    <svg viewBox="0 0 16 16" version="1.1" xmlns="${hardUrl.w3cUrl}" xmlns:xlink="${hardUrl.xlinkUrl}">
        <defs>
            <path d="M8,0 C12.418278,0 16,3.581722 16,8 C16,12.418278 12.418278,
            16 8,16 C3.581722,16 0,12.418278 0,8 C0,3.581722 3.581722,
            0 8,0 Z M8,1 C4.13400675,1 1,4.13400675 1,8 C1,11.8659932 4.13400675,
            15 8,15 C11.8659932,15 15,11.8659932 15,8 C15,
            4.13400675 11.8659932,1 8,1 Z M6.83357948,5.04464795 C7.02209891,
            4.9649556 7.24013422,4.99334733 7.40074496,
            5.11860246 L7.40074496,5.11860246 L10.2919771,7.3817803 C10.4234628,
            7.48506159 10.5,7.64110985 10.5,7.8061474 C10.5,
            7.97118495 10.4234628,8.1272332 10.2919771,8.23051449 L10.2919771,
            8.23051449 L7.40074496,10.4828117 C7.23385748,
            10.6118283 7.00639619,10.6363948 6.81483613,10.5461618 C6.62318919,
            10.4558438 6.50102078,10.2665585 6.5,10.0584446 L6.5,
            10.0584446 L6.5,5.49946815 C6.51687553,5.29915345 6.64508177,
            5.12434031 6.83357948,5.04464795 Z" id="path-1"></path>
        </defs>
        <g id="控件" stroke="none" stroke-width="1" fill="none" fill-rule="evenodd">
            <g id="画板" transform="translate(-189.000000, -22.000000)">
                <g id="编组" transform="translate(189.000000, 22.000000)">
                    <mask id="mask-2" fill="white">
                        <use xlink:href="#path-1"></use>
                    </mask>
                    <use id="蒙版" fill="#979797" fill-rule="nonzero" xlink:href="#path-1"></use>
                    <g mask="url(#mask-2)" fill="#979797" id="3.颜色/9.辅助文字">
                        <g>
                            <rect id="矩形备份-6" x="0" y="0" width="16" height="16"></rect>
                        </g>
                    </g>
                </g>
            </g>
        </g>
    </svg>
  `
};

export const startTaskDisabled: IStaticIcon = {
  name: 'startTaskDisabled',
  data: `
    <?xml version="1.0" encoding="UTF-8"?>
    <svg viewBox="0 0 16 16" version="1.1" xmlns="${hardUrl.w3cUrl}" xmlns:xlink="${hardUrl.xlinkUrl}">
        <defs>
            <path d="M8,0 C12.418278,0 16,3.581722 16,8 C16,12.418278 12.418278,
            16 8,16 C3.581722,16 0,12.418278 0,8 C0,3.581722 3.581722,
            0 8,0 Z M8,1 C4.13400675,1 1,4.13400675 1,8 C1,11.8659932 4.13400675,
            15 8,15 C11.8659932,15 15,11.8659932 15,8 C15,
            4.13400675 11.8659932,1 8,1 Z M6.83357948,5.04464795 C7.02209891,
            4.9649556 7.24013422,4.99334733 7.40074496,
            5.11860246 L7.40074496,5.11860246 L10.2919771,7.3817803 C10.4234628,
            7.48506159 10.5,7.64110985 10.5,7.8061474 C10.5,
            7.97118495 10.4234628,8.1272332 10.2919771,8.23051449 L10.2919771,
            8.23051449 L7.40074496,10.4828117 C7.23385748,
            10.6118283 7.00639619,10.6363948 6.81483613,10.5461618 C6.62318919,
            10.4558438 6.50102078,10.2665585 6.5,10.0584446 L6.5,
            10.0584446 L6.5,5.49946815 C6.51687553,5.29915345 6.64508177,
            5.12434031 6.83357948,5.04464795 Z" id="path-1"></path>
        </defs>
        <g id="控件" stroke="none" stroke-width="1" fill="none" fill-rule="evenodd">
            <g id="画板" transform="translate(-189.000000, -85.000000)">
                <g id="启动任务Disabled" transform="translate(189.000000, 85.000000)">
                    <mask id="mask-2" fill="white">
                        <use xlink:href="#path-1"></use>
                    </mask>
                    <use id="蒙版" fill="#979797" fill-rule="nonzero" xlink:href="#path-1"></use>
                    <g id="编组" mask="url(#mask-2)" fill="#CCCCCC">
                        <g id="3.颜色/9.辅助文字">
                            <rect id="矩形备份-6" x="0" y="0" width="16" height="16"></rect>
                        </g>
                    </g>
                </g>
            </g>
        </g>
    </svg>
  `
};
