import { IStaticIcon } from '../../domain';
const hardUrl: any = require('../../../../assets/hard-coding/url.json');
/** 工程管理-创建工程 */
export const viewTaskDetailActive: IStaticIcon = {
  name: 'viewTaskDetailActive',
  data: `
    <?xml version="1.0" encoding="UTF-8"?>
    <svg width="16px" height="16px" viewBox="0 0 16 16" version="1.1"
    xmlns="${hardUrl.w3cUrl}" xmlns:xlink="${hardUrl.xlinkUrl}">
        <title>Web_SFW/icon/16/报告详情/Normal</title>
        <g id="Web_SFW/icon/16/报告详情/Normal" stroke="none" stroke-width="1" fill="none" fill-rule="evenodd">
            <rect id="BOX" opacity="0.135765439" x="1" y="1" width="14" height="14"></rect>
            <g id="编组" transform="translate(0.500000, 1.000000)" fill="#0057D9">
                <path d="M3.5,14 C1.78729128,14 0.588122847,12.8619997 0.504652536,11.188157 L0.5,11 L0.5,
                6 C0.5,5.22030388 1.09488808,4.57955132 1.85553999,4.50686658 L2,4.5 L3.5,4.5 L3.5,1 C3.5,
                0.44771525 3.94771525,0 4.5,0 L13.5,0 C14.0522847,0 14.5,0.44771525 14.5,1 L14.5,13 C14.5,
                13.5522847 14.0522847,14 13.5,14 L3.5,14 Z M13.5,1 L4.5,1 L4.5,13 L13.5,13 L13.5,1 Z M3.5,
                5.5 L2,5.5 C1.75454011,5.5 1.55039163,5.67687516 1.50805567,5.91012437 L1.5,6 L1.5,
                11 C1.5,12.1682277 2.20718758,12.9285166 3.33591626,12.99522 L3.5,13 L3.5,5.5 Z M12,6 C12.2761424,
                6 12.5,6.22385763 12.5,6.5 C12.5,6.77614237 12.2761424,7 12,7 L6,7 C5.72385763,7 5.5,6.77614237 5.5,
                6.5 C5.5,6.22385763 5.72385763,6 6,6 L12,6 Z M12,3 C12.2761424,3 12.5,3.22385763 12.5,3.5 C12.5,
                3.77614237 12.2761424,4 12,4 L6,4 C5.72385763,4 5.5,3.77614237 5.5,3.5 C5.5,3.22385763 5.72385763,
                3 6,3 L12,3 Z" id="形状结合"></path>
            </g>
        </g>
    </svg>
  `
};

export const viewTaskDetailHover: IStaticIcon = {
  name: 'viewTaskDetailHover',
  data: `
    <?xml version="1.0" encoding="UTF-8"?>
    <svg width="16px" height="16px" viewBox="0 0 16 16" version="1.1"
    xmlns="${hardUrl.w3cUrl}" xmlns:xlink="${hardUrl.xlinkUrl}">
        <title>Web_SFW/icon/16/报告详情/Normal</title>
        <g id="Web_SFW/icon/16/报告详情/Normal" stroke="none" stroke-width="1" fill="none" fill-rule="evenodd">
            <rect id="BOX" opacity="0.135765439" x="1" y="1" width="14" height="14"></rect>
            <g id="编组" transform="translate(0.500000, 1.000000)" fill="#267DFF">
                <path d="M3.5,14 C1.78729128,14 0.588122847,12.8619997 0.504652536,11.188157 L0.5,11 L0.5,
                6 C0.5,5.22030388 1.09488808,4.57955132 1.85553999,4.50686658 L2,4.5 L3.5,4.5 L3.5,1 C3.5,
                0.44771525 3.94771525,0 4.5,0 L13.5,0 C14.0522847,0 14.5,0.44771525 14.5,1 L14.5,13 C14.5,
                13.5522847 14.0522847,14 13.5,14 L3.5,14 Z M13.5,1 L4.5,1 L4.5,13 L13.5,13 L13.5,1 Z M3.5,
                5.5 L2,5.5 C1.75454011,5.5 1.55039163,5.67687516 1.50805567,5.91012437 L1.5,6 L1.5,
                11 C1.5,12.1682277 2.20718758,12.9285166 3.33591626,12.99522 L3.5,13 L3.5,5.5 Z M12,6 C12.2761424,
                6 12.5,6.22385763 12.5,6.5 C12.5,6.77614237 12.2761424,7 12,7 L6,7 C5.72385763,7 5.5,6.77614237 5.5,
                6.5 C5.5,6.22385763 5.72385763,6 6,6 L12,6 Z M12,3 C12.2761424,3 12.5,3.22385763 12.5,3.5 C12.5,
                3.77614237 12.2761424,4 12,4 L6,4 C5.72385763,4 5.5,3.77614237 5.5,3.5 C5.5,3.22385763 5.72385763,
                3 6,3 L12,3 Z" id="形状结合"></path>
            </g>
        </g>
    </svg>
  `
};

export const viewTaskDetailNormal: IStaticIcon = {
  name: 'viewTaskDetailNormal',
  data: `
    <?xml version="1.0" encoding="UTF-8"?>
    <svg viewBox="0 0 16 16" version="1.1" xmlns="${hardUrl.w3cUrl}" xmlns:xlink="${hardUrl.xlinkUrl}">
        <title>Web_SFW/icon/16/报告详情/Normal</title>
        <g id="Web_SFW/icon/16/报告详情/Normal" stroke="none" stroke-width="1" fill="none" fill-rule="evenodd">
            <rect id="BOX" opacity="0.135765439" x="1" y="1" width="14" height="14"></rect>
            <g id="编组" transform="translate(0.500000, 1.000000)" fill="#979797">
                <path d="M3.5,14 C1.78729128,14 0.588122847,12.8619997 0.504652536,11.188157 L0.5,11 L0.5,
                6 C0.5,5.22030388 1.09488808,4.57955132 1.85553999,4.50686658 L2,4.5 L3.5,4.5 L3.5,1 C3.5,
                0.44771525 3.94771525,0 4.5,0 L13.5,0 C14.0522847,0 14.5,0.44771525 14.5,1 L14.5,13 C14.5,
                13.5522847 14.0522847,14 13.5,14 L3.5,14 Z M13.5,1 L4.5,1 L4.5,13 L13.5,13 L13.5,1 Z M3.5,
                5.5 L2,5.5 C1.75454011,5.5 1.55039163,5.67687516 1.50805567,5.91012437 L1.5,6 L1.5,
                11 C1.5,12.1682277 2.20718758,12.9285166 3.33591626,12.99522 L3.5,13 L3.5,5.5 Z M12,6 C12.2761424,
                6 12.5,6.22385763 12.5,6.5 C12.5,6.77614237 12.2761424,7 12,7 L6,7 C5.72385763,7 5.5,6.77614237 5.5,
                6.5 C5.5,6.22385763 5.72385763,6 6,6 L12,6 Z M12,3 C12.2761424,3 12.5,3.22385763 12.5,3.5 C12.5,
                3.77614237 12.2761424,4 12,4 L6,4 C5.72385763,4 5.5,3.77614237 5.5,3.5 C5.5,3.22385763 5.72385763,
                3 6,3 L12,3 Z" id="形状结合"></path>
            </g>
        </g>
    </svg>
  `
};

export const viewTaskDetailDisabled: IStaticIcon = {
  name: 'viewTaskDetailDisabled',
  data: `
    <?xml version="1.0" encoding="UTF-8"?>
    <svg width="16px" height="16px" viewBox="0 0 16 16" version="1.1"
    xmlns="${hardUrl.w3cUrl}" xmlns:xlink="${hardUrl.xlinkUrl}">
        <title>Web_SFW/icon/16/报告详情/Normal</title>
        <g id="Web_SFW/icon/16/报告详情/Normal" stroke="none" stroke-width="1" fill="none" fill-rule="evenodd">
            <rect id="BOX" opacity="0.135765439" x="1" y="1" width="14" height="14"></rect>
            <g id="编组" transform="translate(0.500000, 1.000000)" fill="#CCCCCC">
                <path d="M3.5,14 C1.78729128,14 0.588122847,12.8619997 0.504652536,11.188157 L0.5,11 L0.5,
                6 C0.5,5.22030388 1.09488808,4.57955132 1.85553999,4.50686658 L2,4.5 L3.5,4.5 L3.5,1 C3.5,
                0.44771525 3.94771525,0 4.5,0 L13.5,0 C14.0522847,0 14.5,0.44771525 14.5,1 L14.5,13 C14.5,
                13.5522847 14.0522847,14 13.5,14 L3.5,14 Z M13.5,1 L4.5,1 L4.5,13 L13.5,13 L13.5,1 Z M3.5,
                5.5 L2,5.5 C1.75454011,5.5 1.55039163,5.67687516 1.50805567,5.91012437 L1.5,6 L1.5,
                11 C1.5,12.1682277 2.20718758,12.9285166 3.33591626,12.99522 L3.5,13 L3.5,5.5 Z M12,6 C12.2761424,
                6 12.5,6.22385763 12.5,6.5 C12.5,6.77614237 12.2761424,7 12,7 L6,7 C5.72385763,7 5.5,6.77614237 5.5,
                6.5 C5.5,6.22385763 5.72385763,6 6,6 L12,6 Z M12,3 C12.2761424,3 12.5,3.22385763 12.5,3.5 C12.5,
                3.77614237 12.2761424,4 12,4 L6,4 C5.72385763,4 5.5,3.77614237 5.5,3.5 C5.5,3.22385763 5.72385763,
                3 6,3 L12,3 Z" id="形状结合"></path>
            </g>
        </g>
    </svg>
  `
};
